## Plan Result (prod_shutter_webapp - TerraformPlanApply)




<pre><code>Plan: 5 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;sscs-ibca&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;sscs-ibca&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;sscs-ibca&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;sscs-ibca&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;sscs-ibca&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;adoption&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;cui-ra&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;et-staff-pet&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;et-syr&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;private-law&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["sscs-ibca"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "appeal-infected-blood-compensation-decision.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["adoption"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.apply-for-adoption"
        name                = "_dnsauth.apply-for-adoption"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "n3zyn06dl4jk9flktv4d018rxhrrjfm7" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["cui-ra"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/manage-your-support-for-hmcts-services.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_b0yl28i2r5fnud7easfnlecl30qx1c8" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["et-staff-pet"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/employmenttribunals.service.gov.uk/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "z51qchxt096p5249j1mxrl120fzf9r0q" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["et-syr"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/respond-employment-tribunals.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_14224mgrkc7hcu22ch6szfm8ta3z1aa" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["private-law"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements-c100.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_j2gxx1py0szri6b26hf4p8l5qvr0w30" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["sscs-ibca"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "appeal-infected-blood-compensation-decision.service.gov.uk"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["sscs-ibca"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "sscs-ibca"
      + resource_group_name = "cft-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["sscs-ibca"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "www.appeal-infected-blood-compensation-decision.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["sscs-ibca"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "sscs_ibca_prod"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (9 unchanged elements hidden)
        {
            backend_domain    = [
                "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
            certificate_name  = "www-manage-appeal-benefit-decision-service-gov-uk"
            custom_domain     = "www.manage.appeal-benefit-decision.service.gov.uk"
            disabled_rules    = {
                LFI  = [
                    "930100",
                    "930110",
                ]
                SQLI = [
                    "942100",
                    "942150",
                    "942200",
                    "942210",
                    "942230",
                    "942361",
                    "942380",
                    "942400",
                ]
            }
            dns_zone_name     = "appeal-benefit-decision.service.gov.uk"
            global_exclusions = [
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtSa"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "connect.sid"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "iss"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "code"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "_csrf"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "_csrf"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "question-field"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "describeTheEvidence"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_ga"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_gid"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_gat"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtCookie"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtLatC"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtPC"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtSa"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "rxVisitor"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "rxvt"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "cookies_policy"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "rf"
                },
            ]
            mode              = "Prevention"
            name              = "sscs-cor"
            product           = "sscs"
        },
      + {
          + backend_domain    = [
              + "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
          + certificate_name  = "appeal-infected-blood-compensation-decision-service-gov-uk"
          + custom_domain     = "www.appeal-infected-blood-compensation-decision.service.gov.uk"
          + dns_zone_name     = "appeal-infected-blood-compensation-decision.service.gov.uk"
          + global_exclusions = [
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtSa"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "connect.sid"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "iss"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "code"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "_csrf"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "_csrf"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "question-field"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "describeTheEvidence"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_ga"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_gid"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_gat"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtCookie"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtLatC"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtPC"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtSa"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "rxVisitor"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "rxvt"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "cookies_policy"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "rf"
                },
            ]
          + mode              = "Prevention"
          + name              = "sscs-ibca"
          + product           = "sscs"
        },
        {
            backend_domain    = [
                "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
            cache_enabled     = "false"
            certificate_name  = "manage-case-platform-hmcts-net"
            custom_domain     = "manage-case.platform.hmcts.net"
            custom_rules      = [
                {
                    action           = "Allow"
                    match_conditions = [
                        {
                            match_values       = [
                                "POST",
                            ]
                            match_variable     = "RequestMethod"
                            negation_condition = false
                            operator           = "Equal"
                        },
                        {
                            match_values       = [
                                "/rb_",
                            ]
                            match_variable     = "RequestUri"
                            negation_condition = false
                            operator           = "Contains"
                        },
                    ]
                    name             = "RumBeaconExclusion"
                    priority         = 100
                    type             = "MatchRule"
                },
            ]
            disabled_rules    = {
                SQLI = [
                    "942100",
                    "942150",
                    "942200",
                    "942210",
                    "942230",
                    "942361",
                    "942380",
                    "942390",
                    "942400",
                ]
            }
            dns_zone_name     = "platform.hmcts.net"
            global_exclusions = [
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtSa"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "iss"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "__auth__"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "xui-webapp"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "rf"
                },
            ]
            mode              = "Detection"
            name              = "xui-webapp"
            product           = "xui"
        },
        # (33 unchanged elements hidden)
    ]
```

</details>





## :warning: Errors

* add a label prod_shutter_webapp - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2295/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2295,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp - TerraformPlanApply","Vars":{}} -->